#!/usr/bin/env bash

# Taps
tap 'homebrew/cask'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'cmake'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'fish'

# Install Binaries
brew 'git'
brew 'wget'
brew 'vim'
brew 'neovim'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'openssh'
brew 'openssl'
brew 'pkg-config'
brew 'python3'

# Install yarn, a JavaScript package manager
brew 'yarn'

# install glow, a markdown renderer
brew 'glow'

# Apps
cask 'slack'
cask 'spotify'
